In [49]:
import pandas as pd

# 1
series_data = pd.Series([10, 20, 30, 40, 50])
series_data
type(series_data)

lst = [['AR',23, 'Dhaka'], ['SR',20 ,'Rangpur'], ['MM', 25, 'Uttara'], ['AN', 15,]]
d_frame = pd.DataFrame(lst, columns=['Name', 'Age', 'City'])
d_frame

  Name  Age     City
0   AR   23    Dhaka
1   SR   20  Rangpur
2   MM   25   Uttara
3   AN   15     None

In [50]:
# 2
# number of rows and columns 
print(d_frame.shape)
print()

# Data type of columns
print(d_frame.dtypes)
print()

# Summary Statistics
print(d_frame.describe)

(4, 3)

Name    object
Age      int64
City    object
dtype: object

<bound method NDFrame.describe of   Name  Age     City
0   AR   23    Dhaka
1   SR   20  Rangpur
2   MM   25   Uttara
3   AN   15     None>

In [51]:
# 3
data = {
    'Product': ['Pen', 'Book', 'Eraser', 'Pencil'],
    'Price': [10, 50, 5, 7],
    'Quantity': [100, 60, 200, 150]
}

data_table = pd.DataFrame(data)
print(data_table)
print()
print(data_table.columns)
print()
print(data_table.index)
print()

# Single collumn
print(data_table['Product'])
print()

# Single full row
data_table.loc[0]

  Product  Price  Quantity
0     Pen     10       100
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

Index(['Product', 'Price', 'Quantity'], dtype='object')

RangeIndex(start=0, stop=4, step=1)

0       Pen
1      Book
2    Eraser
3    Pencil
Name: Product, dtype: object

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [52]:
# 4 
  # first row
data_table.loc[0]

Product     Pen
Price        10
Quantity    100
Name: 0, dtype: object

In [53]:
  # 2nd column
data_table.iloc[:,1:2]

   Price
0     10
1     50
2      5
3      7

In [54]:
  # 2*2 block from the middle of your dataframe
data_table.iloc[1:3,0:2]

  Product  Price
1    Book     50
2  Eraser      5

In [55]:
# 5
  # drop the index
drop_row = data_table.drop(0)

drop_row

  Product  Price  Quantity
1    Book     50        60
2  Eraser      5       200
3  Pencil      7       150

In [56]:
  # drop the col
drop_col = data_table.drop('Quantity', axis = 1)
drop_col

  Product  Price
0     Pen     10
1    Book     50
2  Eraser      5
3  Pencil      7

In [57]:
# 6
employee = pd.DataFrame([['A', 'FST', 90000],['B', 'FE', 80000],['C', 'FBA', 70000], ['D', 'FE', 80000]], columns=["Name", "Department", "Salary"])

employee.sort_values(['Salary', 'Name'], ascending=[1, 0])

  Name Department  Salary
2    C        FBA   70000
3    D         FE   80000
1    B         FE   80000
0    A        FST   90000

In [58]:
# 7

students = {
    'Name': ['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'],
    'Score': [98, 95, 76, 60, 40, 35, 39, 20]
}

students_d = pd.DataFrame(students)

fltr = students_d.loc[(students_d['Score']>60) | (students_d['Score'] < 40)]
fltr

  Name  Score
0    A     98
1    B     95
2    C     76
5    F     35
6    G     39
7    H     20